# NOTEBOOK - ANALYSIS OF TITANIC PASSENGER DATA

# <font color=blue>Step 1 - Preparation of the Environment</font>

## Import the Packages

In [34]:
# Data manipulation
import pandas as pd
import numpy as np

# Data visualization
import matplotlib.pyplot as plt
import seaborn as sns

# Miscellaneous
import warnings

## Set Parameters of the Notebook

In [35]:
warnings.filterwarnings('ignore')

In [2]:
# Path to data
path_data = "../../data/data_titanic/"

# <font color=blue>Step 2 - Loading of the Data</font>

## Training Data Set

In [3]:
df_train = pd.read_csv(path_data + 'train.csv')

df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Test Data Set

In [4]:
df_test = pd.read_csv(path_data + 'test.csv')

df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# <font color=blue>Step 3 - Preliminary Inspection of the Data Sets</font>

## Check 1 - Columns Information

In [6]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

## Check 2 - Range of Age

Check for:
- Negative age
- Age above 100

In [8]:
df_train['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [9]:
df_test['Age'].describe()

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

## Check 3 - Range of Fare
Check for:
- Negative fare

In [15]:
df_train['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [16]:
df_test['Fare'].describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

## Check 4 - Duplicate Passenger ID

In [10]:
sum(df_train.duplicated(subset = 'PassengerId'))

0

In [12]:
sum(df_test.duplicated(subset = 'PassengerId'))

0

## Check 5 - Duplicate Ticket ID

In [13]:
sum(df_train.duplicated(subset = 'Ticket'))

210

In [14]:
sum(df_test.duplicated(subset = 'Ticket'))

55

## Initial Data Processing

#### Turn Pclass column into a categorical variable

In [24]:
df_train['Pclass'] = df_train['Pclass'].astype('object')
df_test['Pclass'] = df_test['Pclass'].astype('object')

In [47]:
df_train['Embarked'] = df_train['Embarked'].fillna("Missing_Code")
df_test['Embarked'] = df_test['Embarked'].fillna("Missing_Code")

# <font color=blue>Step 4 - Exploratory Data Analysis on Training and Test Sets</font>

In [25]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [50]:
df_train[df_train['Cabin']=='B96 B98']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
390,391,1,1,"Carter, Mr. William Ernest",male,36.0,1,2,113760,120.0,B96 B98,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.0,B96 B98,S
763,764,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,113760,120.0,B96 B98,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,113760,120.0,B96 B98,S

In [51]:
df_train[df_train['Cabin']=='C23 C25 C27']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0,C23 C25 C27,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0,C23 C25 C27,S

In [49]:
df_train['Cabin'].value_counts()

B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: Cabin, Length: 147, dtype: int64

## Univariate Analysis

### Passenger Class

In [38]:
### Get the total number of distinct classes accross the 2 data sets
list_classes = list(set(list(df_train['Pclass'].unique()) + list(df_test['Pclass'].unique())))

### Get count and proportion of passengers in each class
# Initiate result table
table_result = pd.DataFrame()

# Loop over each class
for class_id in list_classes:
    # Initiate result for the class
    dict_result = {}
    # Fill the dictionary
    dict_result['Class'] = class_id
    dict_result['Count_Train'] = sum(df_train['Pclass'] == class_id)
    dict_result['Perc_Train'] = np.round(sum(df_train['Pclass'] == class_id) / df_train['Pclass'].shape[0] * 100, 2)
    dict_result['Count_Test'] = sum(df_test['Pclass'] == class_id)
    dict_result['Perc_Test'] = np.round(sum(df_test['Pclass'] == class_id) / df_test['Pclass'].shape[0] * 100, 2)
    # Add result to final table
    dict_result = pd.DataFrame.from_dict(dict_result, orient='index').T
    table_result = table_result.append(dict_result)

# Display table
table_result

   Class  Count_Train  Perc_Train  Count_Test  Perc_Test
0    1.0        216.0       24.24       107.0      25.60
0    2.0        184.0       20.65        93.0      22.25
0    3.0        491.0       55.11       218.0      52.15

### Sex Category

In [40]:
### Get the total number of distinct classes accross the 2 data sets
list_sex_cat = list(set(list(df_train['Sex'].unique()) + list(df_test['Sex'].unique())))

### Get count and proportion of passengers in each class
# Initiate result table
table_result = pd.DataFrame()

# Loop over each class
for sex_cat in list_sex_cat:
    # Initiate result for the class
    dict_result = {}
    # Fill the dictionary
    dict_result['Sex'] = sex_cat
    dict_result['Count_Train'] = sum(df_train['Sex'] == sex_cat)
    dict_result['Perc_Train'] = np.round(sum(df_train['Sex'] == sex_cat) / df_train['Sex'].shape[0] * 100, 2)
    dict_result['Count_Test'] = sum(df_test['Sex'] == sex_cat)
    dict_result['Perc_Test'] = np.round(sum(df_test['Sex'] == sex_cat) / df_test['Sex'].shape[0] * 100, 2)
    # Add result to final table
    dict_result = pd.DataFrame.from_dict(dict_result, orient='index').T
    table_result = table_result.append(dict_result)

# Display table
table_result

      Sex Count_Train Perc_Train Count_Test Perc_Test
0    male         577      64.76        266     63.64
0  female         314      35.24        152     36.36

### Port of Embarkation

In [48]:
### Get the total number of distinct classes accross the 2 data sets
list_port = list(set(list(df_train['Embarked'].unique()) + list(df_test['Embarked'].unique())))

### Get count and proportion of passengers in each class
# Initiate result table
table_result = pd.DataFrame()

# Loop over each class
for port_code in list_port:
    # Initiate result for the class
    dict_result = {}
    # Fill the dictionary
    dict_result['Port'] = port_code
    dict_result['Count_Train'] = sum(df_train['Embarked'] == port_code)
    dict_result['Perc_Train'] = np.round(sum(df_train['Embarked'] == port_code) / df_train['Embarked'].shape[0] * 100, 2)
    dict_result['Count_Test'] = sum(df_test['Embarked'] == port_code)
    dict_result['Perc_Test'] = np.round(sum(df_test['Embarked'] == port_code) / df_test['Embarked'].shape[0] * 100, 2)
    # Add result to final table
    dict_result = pd.DataFrame.from_dict(dict_result, orient='index').T
    table_result = table_result.append(dict_result)

# Display table
table_result

           Port Count_Train Perc_Train Count_Test Perc_Test
0             C         168      18.86        102      24.4
0             S         644      72.28        270     64.59
0  Missing_Code           2       0.22          0       0.0
0             Q          77       8.64         46      11.0

## Multivariate Analysis

# <font color=blue>Step 5 - Exploratory Data Anlysis on Training Set Only</font>

Deep dive on the training data set by introducing the target variable Survived and assessing its relation with the explanatory variables of the data set